<?php


    function connectDB() {

        $dbhost = 'localhost';
        $dbuser = 'root';
        $dbpass = '';
        $dbname = 'temple_digital_project';

        mysqli_report(MYSQLI_REPORT_STRICT);

        try {

            $con = new mysqli($dbhost, $dbuser, $dbpass, $dbname);
            mysqli_set_charset($con,"utf8");
            date_default_timezone_set('Asia/Bangkok');
            $status = 1;
        } catch (Exception $e ) {

            $status = 0;

        }
        return array('0' => $status, '1' => $con);

    }

    function split_sentence($text, $segment) {

            $text_to_segment = trim($text);
            $wordList = $segment->get_segment_array($text_to_segment);
            return $wordList;
    }

    function remove_stopword($input) {

       $stopWords = array('กล่าว','กว่า','กัน','กับ','การ','ก็','ก่อน', 'ก่อ', 'โก', 'แก่', 'กว้าง', 'กำแพง', 'เก่าแก่', 'กล่าวว่า','ขณะ','ขอ','ของ','ขึ้น', 'เขา','เข้า','คง','ครั้ง','ความ','คือ', 'เคย', 'ควร','จะ','จัด','จาก','จึง', 'จัง', 'จุด', 'เจ้าอาวาส','จน', 'จ.','เฉพาะ','เช่น','ช่วง', 'ชั้น','ชนิด','ซึ่ง', 'ชม', 'ชื่อ', 'รัชสมัย', 'ชัด', 'ใช้','ชาว','ดัง','ด้วย','ด้าน', 'เดียว', 'โดย','ได้','ดั่ง','ตั้ง','ตั้งแต่','ตาม','ต่อ','ต่าง','ต่างๆ','ต้อง', 'แต่','ถึง','ถูก','ถ้า','ทั้ง','ทั้งนี้','ทาง','ที่','ที่สุด','ทุก','ทํา','ทําให้','ท่า', 'ทรง', 'ฐาน', 'ทอง', 'ถ.','ถนน', 'ทอด', 'ถือ','ทัศนียภาพ', 'ที่เกิด', 'ทรัพย์', 'เที่ยว', 'ทาง','นอกจาก','นัก','นั้น','นี้','น่า','นํา', 'เนื่องจาก', 'ใน','บน','โบ','แบบ','บาง','บุคคล','บ้าน','บริเวณ','ปัจจุบัน', 'ปูน','ประวัติศาสตร์','บันได','ปาง','เป็นที่รู้จัก','ประดิษฐาน','ปรากฏ','ปี','ประกอบด้วย','ประจำ','ประมาณ','ไป','ปิด','เปิด','เป็น','เผย','ผล','ผ่าน','พบ','พร้อม','เพราะ','เพื่อ', 'พ.ศ.', 'พ.', 'ศ.','มา','มาก','มี', 'เมื่อ', 'ไม่', 'เมือง','ยัง', 'ยอด','เรียก', 'ราม', 'ราณ', 'รวม','ระหว่าง','รับ','ราย','ร่วม', 'เรา','เริ่ม', 'แรก','และ','แล้ว','เลย','ลง', 'ลาน',  'รูป','วัน','ว่า', 'ไว้', 'วัด','สุด','ส่ง','ส่วน','สําหรับ', 'สำคัญ', 'สร้าง', 'สูง', 'ศิลปะ','แห่ง','หนึ่ง','หรือ','หลัง','หลังจาก','หลาย','หาก', 'เห็น', 'ให้', 'หวัด','อยาก','อยู่','อย่าง','ออก','อะไร','อาจ','อีก', 'เอง','บล', 'เภอ', 'ครั้ง', 'ย่อมุม', 'ดิน','ณ','สำคัญ', 'แผ่น','นับ','แต่','อดีต', 'ตำ','ต.','อำ','อ.','ภายใน','รวม','พระพุทธรูป', 'เฉพาะ','คำ', '','คู่', 'แน่','เด่น', 'สมัย','โดย','ขนาด', 'ละ','เมตร','องค์', 'เขต','ยาว', 'ๆ', 'สามารถ','สวยงาม','ครบ','นาน', 'คาด' ,'สถานที่','อัน','ริม', 'ใหญ่','คล้าย','พระประธาน', 'อนา','ล','รถยนต์','ยาว','ผู้', 'เลข','ไร่', 'เนื้อที่', 'ใด','ตนเอง','ราว','มี', 'เหมือน','ศอก','พ่อ', 'แปลง','ขาว','ต่อมา','ยกฐานะ','จุด','รวบ','เรื่อง','นอก','แสดง','เก็บ','ห่าง','บรรจุ','ยัง','ค่อน','สมบูรณ์','แบบ','เรียกชื่อ','ที่จะ','ทำให้','พา','แต่ละ','เข้ามา','เข้าไป','นั่น', 'เท่า','ทั่ว','ทุก','แวะเวียน','เยี่ยมชม','นั่น','ช้า','ชัดเจน','สภาพ','ประจำปี','งาน','น่าสนใจ','เนื้อ','แท่น','ลูก','เกาะ','เนิน','จัดวาง','ถัด','บริเวณ','ทั้งหมด','ตารางวา','มีอยู่','นับ','ต้น','ยี่สิบ','แปล','ใจ','แผนก','ควบคู่','จัดตั้ง','สำหรับ','สนใจ','คง','ทำลาย','เป็นต้นมา','จากนี้','แถว','ใคร','ปรากฏ','ทำนุ','บำรุง','ก่อนที่','จด','ส่งเสริม','เชิง','ร้านค้า','เก่า','น่าชม','ความร่มเย็น','ไกล','ย่าน','ปก','คลุม','แม้','เหมาะ','ปน','แปลก', 'เหล่า','กลับ','การอบรม','มาบ','ก็','เจาะจง','ความรู้','ทั้งสิ้น','ภายใน','วัดขึ้นใหม่แทนวัด','ทรุดโทรม','บ่อย', 'คน', 'ไม้', 'หล', 'วงใน', 'มีชื่อ', 'น่าจะ', 'อยุ', 'ของวัด', 'โดยรอบ', 'จา', 'กวัด', 'พรรษา', 'ใหม่', 'พระ', 'ขึ้นไป', 'ท่าน', 'แต่ไกล', 'มองเห็น', 'พื้นที่', 'สิ่งก่อสร้าง', 'เป็นวัด', 'ต้น', 'พัน', 'นั่ง', 'เบื้อง', 'ประดับ', 'เรียกว่า', 'สง่า', 'เฝ้า', 'หน้า', 'ความสวยงาม', 'อ่อนโยน', 'ปั้น', 'ช่าง', 'นาย', 'รง', 'การเขียน', 'ภาพ', 'ประวัติ', 'กำเนิด', 'สี', 'เขียน', 'ทรงคุณค่า', 'อย่างยิ่ง', 'ยืน', 'ทำเป็น', 'เล็ก', 'ซ้าย', 'ขวา', 'ตรงข้าม', 'ทำ', 'ซ้อน', 'มุข', 'ลด', 'ด้านหลัง', 'บัน', 'ตี', 'แผ่น', 'กระดาน', 'เรียง', 'ต่อกัน', 'แสดงออก', 'ความงดงาม', 'หา', 'ยาก', 'ลาก', 'ต่ำ', 'บ้านเรือน', 'เดิม', 'แถบ', 'ลดหลั่น', 'สาม', 'มุง', 'เกร็ด', 'แป้น', 'ลักษณะเด่น', 'หน้าต่าง', 'ขนาดเล็ก', 'แคบ', 'แสง', 'น้อยมาก', 'บรรยากาศ', 'มือ', 'น้อมทำให้เ', 'กิ', 'เช้า', 'สาดส่อง', 'หน่า', 'กระทบ', 'ทำให้เกิด', 'ราว', 'ที', 'ชาวบ้าน', 'กม.', 'ม่วง', 'หมู่', 'ม.', 'แยก', 'ทางหลวง', 'หมายเลข', 'กิโลเมตร', 'ฯ', 'อุทยาน', 'ศา', 'สน', 'เก๋ง', 'ลีลา', 'หอ', 'จำลอง', 'ทองคำ', 'ฯลฯ', 'ร่มรื่น', 'ขวาง', 'แวดล้อม', 'ป่าไม้', 'มีท', 'คำมา', 'ปีขาล', 'ได้มา', 'ถาง', 'ทำเนียบ', 'บาท', 'แต่เดิม', 'พื้นฐาน', 'คต', 'ระ', 'เบียง', 'ฝา', 'ผนัง', 'สัก', 'สม', 'บูรณ์', 'ตา', 'สำนัก', 'ความสะอาด', 'สงบ', 'สันติ', 'เหมาะสม', 'เดิน', 'มุม', 'ประเทศ', 'สู่', 'หว่าง', 'ไต', 'อา', 'คาร', 'ปลาย', 'นำ','ตั้งอยู่บนยอด','ซึ่งเป็น','ประ','เทศ','ฝึก','ติด','บาน','สักเป็น','ยิ่งขึ้น','ทั้งเป็น','ได้แก่','ทั้งอยู่','ทางขึ้น','แ','บบ','เป็นหนึ่ง','ก่อสร้าง','งดงาม','มีพ','วาระ','ออกแบบ','จนถึง','ถือเป็น','อันเป็น','กก','สวย','สอง','อี','อ้อ','สิ่ง','รายรอบ','โดดเด่น','โชค','ที่สูง','รูปทรง','ลักษณะ','ผสม','ทั้งสอง','ข้าง','ได','ล้อมรอบ','เล็กๆ','วัดแห่งนี้เป็น','ฟุต','นิ้ว','ติ','สว่าง','แสดงถึง','หนึ่งเดียว','ดู','ตัว','ตรง','หัน','ชน','ได้รับ','แต่ง','เดิมชื่อ','เข่ง','ผู้สร้าง','ด้านหน้า','ทางเข้า','กลาง','มีทาง','ลาด','มีส','เกล็ด','น้อมนำให้เ','ิงปั้นคู่นั่ง','ยังคง','โดยทั่วไป','หรือวัด','สัน','เส้นทาง','ย่าง','ยาวนาน','และเป็น','ปีเกิด','เลขที่','เพื่อเป็น','มีคำ','นอกจากนี้','ที่เก็บ','จัดแสดง','เครื่อง','ยังอยู่','มีอีกชื่อ','แบ','บอ','ใหญ','สถานที่สำคัญ','เห','ตุ','สิ่งแวดล้อม','โล','ก','ปลูกสร้าง','ทุกคน','นั่นเอง','ที่นี่','ช้านาน','นำมา','วัดยังเป็น','คา','ด','ผัง','ส่วนประกอบ','มีบันไดนาคนำขึ้นไปสู่','แนว','นำไปสู่','เคยเป็น','เป็นเวลา','ซาว','ห่ม','แจ้','สาย','บริเวณวัด','ทางวัด','ทั่วไป','คงจะ','ใครเป็น','คุณ','รัง','ดง','น้อยลง','บูร','จัน','ท','ให้เป็น','แหล่ง','อด','ตเคยเป็น','อย่างหนึ่ง','ลงมา','ย้อย','ห้อย','ที่อยู่','เหล่านี้','อาศัย','เว','–','มะ','ก็ได้','ไม่ได้','ใดๆ','สูงใหญ่','็นแ','บ่งบอก','ยุค','ไปมา','ค่อย','สะดวก','แก','รู้จัก','ชื่อว่า','นอกจากนั้น','รอบ','ลอด','ขอพร','อีกด้วย','วัดเป็น','ที่ตั้ง','รอย','ขั้น','เล่าเรื่อง','กลายเป็น','อาทิ','ในวัด','มีแผน','ข้อมูล','ประกอบ','แสดงให้เห็น','ไม่ว่า','กลุ่ม','ของดี','ยา','กอ','อกแตก','ที่เป็น','อย่างไรก็ตาม','เพราะวัด','ด้วยกัน','ย่อมๆ','อย่างเป็นระเบียบ','ผสมผสาน','ป็นวัด','มีบทบาท','อย่างดี','การพัฒนา','ถือว่า','วัดนี้ก็ยังเป็น','พึ่งพา','อ','สอดคล้อง','การเปลี่ยนแปลง','สังคม','มิได้','น่าจะเป็น','ตารางกิโลเมตร','วันที่','ตาราง','ติดกับ','ที่ดิน','ประชาชน','ซอย','แท้จริง','ความเป็นมา','มีประวัติ','ย้อนกลับ','ยุคสมัย','มาตั้งอยู่บนน','แขวง','เป็นการ','แบ่ง','ดีเป็น','วา','คืบ','แต่งเป็น','คติ','ขอบ','ตลอด','เสริม','พื้น','ห้า','เป็นยอด','อันดับ','นับว่า','ภายนอก','ภายในเป็น','เพียง','อื่น','ระดับ','พนั','กระ','ฟัก','หล่อ','นวัดราษฎร์ชื่อวัด','ที่ประทับ','โปรด','พร้อมกับ','จากนั้น','เปลี่ยน','นิพ','กรุณา','นาม','ของผู้ทำประโยชน์แก่ประเทศ','ทุกปี','เห็นสมควร','มิถุนายน','เมื่อใด','ภายหลัง','หมายถึง','ร่วมกัน','ผา','ติก','รรมสถาปนาวัด','ทา','ริมถนน','เป็นที่ตั้ง','ล้อม','ธรรมดา','ดังนี้','อยู่ป','[1]','ตก','เสร็จ','ทำพิธี','ดก','สวัด','ตัวอย่าง','ี่ดินตั้งวัด','ติดต่อ','เพาะ','แข้ง','มากมาย','ชุมนุม','ความเก่า','ฉาก','บ่วง','ที่ทาง','งฆ์','ต้ั้งวัด','เข','ทิศเนือ','ชื่อวัด','เศษ','เล่ม','สำรวจ','เวลา','วัดนี้เป็นวัด','ในสังกัด','ทับที่','ทั้งหลาย','นิก','ประกาศ','นับเป็น','ฝั่ง','โกร','และเป็นวัด','กะ','พัง','มีความ','เป็นสำคัญ','เดิมทีเดียว','วัดนี้มีชื่อว่าวัด','บ่อยครั้ง','เดิมเป็น','มีความสำคัญ','หลวง','มัง','ว่าวัด','โดยเฉพาะ','ตำบล','อย่างสวยงาม','ตน','และถือเป็น','รูปแบบ','ส่วนหนึ่ง','ยึด','เป็นหนึ่งเดียว','ขนาดใหญ่','ภายในวัด','ตระการตา','ตะคุ่ม','รวบรวม','เรื่องราว','ซึ่งชาวแม่ฮ่องสอนเรียกว่าหนองจองคำเป็น','อาคารวัดเท่านั้น','มีอายุ','มีต้นไม้ใหญ่ขึ้นปกคลุมสร้างความร่มรื่นและสร้างความควา','นับแต่','แน่ชัด','เรียกขาน','อย่า','เกิด','ฝ่าย','ตลอดจน','แพร่หลาย','ดำเนินการ','แทน');


        $result = array_diff($input,$stopWords);
        //echo '<h4> List of stopwords:</h4>';
        //echo implode('|', $stopWords);
        return $result;
    }

    function readInvertedIndex() {

        $connection = connectDB();
        $connected=$connection['0'];
        $con=$connection['1'];

        if ($connected)  {
            $sql= "select * from inverted_index";
            $rs=$con->query($sql);
            $arr = $rs->fetch_all(MYSQLI_ASSOC);
            foreach($arr as $row) {
               $invertedIndex[$row['keyword']] = $row['DocID'];
            }
        }
        $con->close();
        return  $invertedIndex;
    }


?>
